tutorials/multiPhysics/buoyantBoussinesqPimpleEddyCurrentFoam/tubafSi2Daxi/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             none;
}

gradSchemes
{
    default             Gauss linear;

    curl(ARe)           Gauss skewCorrected linear;
    curl(AIm)           Gauss skewCorrected linear;
}

divSchemes
{
    default             none;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

// ************************************************************************* //
