tutorials/multiPhysics/buoyantBoussinesqPimpleEddyCurrentFoam/tubafSi2Daxi/system/region_thermal/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                               none;

    ddt(T)                                Euler;
}

gradSchemes
{
    default                               none;

// TODO: Wrong!
    grad(T)                               Gauss linear;
}

divSchemes
{
    default                               none;

    div(phi,T)                            Gauss linear;
}

laplacianSchemes
{
    default                               none;

// TODO: What about alphat in fluid region?
    laplacian(lambda,T)                   Gauss harmonic corrected;
}

interpolationSchemes
{
    default                               none;

// TODO: Wrong!
    interpolate(grad(T))                  linear;

// TODO: Replace after removing U with phi
    interpolate(U)                        linear;
}

// ************************************************************************* //
